{
    "name": "Privacy Policy",
    "date_created": "2025-01-01",
    "version": "1",
    "change_log": "Initial version",
    "content": "<div><p><strong>Last Updated:</strong> 01/19/2025</p><p>Carver Endeavors LLC (“Company,” “we,” “us,” or “our”) operates RL Bets (the “Platform”), providing an online environment where users (“Users,” “you,” or “your”) can purchase fictional Credits, place wagers, and track winnings related to Rocket League esports events. We respect your privacy and are committed to protecting your personal data. This Privacy Policy describes the types of information we collect, how we use it, and your choices regarding your information. If you do not agree with our practices, please do not use RL Bets or otherwise provide us with your personal data.</p><h2>1. Personal Information Collection & Use</h2><h3>1.1 Information You Provide</h3><p>We collect certain personal information when you create an account, place wagers, or otherwise interact with the Platform. This information may include:</p><ul><li>Name (first and last)</li><li>Email Address</li><li>Date of Birth</li><li>Physical Address (including city, state, and zip code)</li><li>Phone Number</li><li>Identification Documents (if required for Know Your Customer (KYC) verification)</li></ul><h3>1.2 Financial Details</h3><ul><li>Credit/Debit Card Information: Handled directly by Stripe. We do not store or process your card details on our servers.</li><li>Payment Account Information (e.g., PayPal, Venmo, Cash App usernames) when necessary to facilitate payouts.</li></ul><h3>1.3 Usage Information</h3><p>We may collect information about how you use the Platform, such as which wagers you participate in, the time and date of your visits, and the pages or features you access.</p><h3>1.4 Purpose of Collection</h3><p>We collect and use personal data to:</p><ul><li>Verify your identity, age, and location (to comply with betting regulations).</li><li>Process and facilitate credit purchases and wagers.</li><li>Communicate with you regarding your account, promotions, or updates to our services.</li><li>Comply with legal obligations (e.g., anti-fraud measures, dispute resolution).</li><li>Improve and personalize the Platform’s functionality and user experience.</li></ul><h2>2. Third-Party Services & Data Sharing</h2><h3>2.1 Third-Party Providers</h3><p>We may share or receive data from third-party providers that help us operate and maintain the Platform, including:</p><ul><li>Stripe for payment processing.</li><li>Firebase Storage for identity, age, and document verification (KYC).</li><li>Firebase Admin for authentication and analytics.</li><li>Nominatim for reverse geocoding user location data.</li><li>Google AdSense (if we implement advertising).</li></ul><h3>2.2 Data Use & Policies</h3><p>Each of these third-party services has its own privacy policies and data-handling practices. We share user data with them only as necessary to deliver core Platform functionality (e.g., verifying identity, processing payments, authenticating users). We do not sell your personal data to third parties.</p><h3>2.3 Legal Compliance & Protection</h3><p>We may disclose personal information if required by law, court order, or government regulation, or if such disclosure is necessary to protect the rights, property, or safety of our Company, Users, or the public.</p><h2>3. Data Retention & Deletion</h2><h3>3.1 Retention Period</h3><p>We generally retain personal data indefinitely unless you request account deletion or we are otherwise required by law to remove it. This is to:</p><ul><li>Maintain accurate records of bets and financial transactions.</li><li>Comply with legal and regulatory obligations.</li><li>Prevent fraudulent or duplicate sign-ups (e.g., by retaining your email or partial records).</li></ul><h3>3.2 Account Deletion Process</h3><p>If you decide to delete your account, you may do so by navigating to your Profile and clicking the Delete Account button. Upon receiving your request, we will delete your personal data within a reasonable timeframe. However, we may retain your email address or other minimal data to prevent abuse of sign-up promotions or to satisfy legal obligations (e.g., financial recordkeeping).</p><h3>3.3 Compliance & Exceptions</h3><p>We may retain certain minimal information (e.g., transaction histories, audit logs) to comply with legal, tax, anti-fraud, or other regulatory obligations, even after your account is deleted. We will keep your data for only as long as is necessary to fulfill the purposes outlined in this Privacy Policy, unless a longer retention period is required or permitted by law.</p><h2>4. Security Measures</h2><h3>4.1 Data Protection Practices</h3><p>We employ a variety of technical and organizational security measures to protect your personal data against unauthorized access, alteration, disclosure, or destruction. These may include:</p><ul><li>Encrypted Connections: We use HTTPS/TLS to encrypt data in transit.</li><li>Hashed Passwords: User passwords are stored in a hashed format to prevent misuse.</li><li>Restricted Database Access: Only authorized personnel can access production databases.</li><li>Routine Monitoring: We monitor activity for suspicious logins or transactions.</li></ul><h3>4.2 No Absolute Security</h3><p>While we strive to protect your personal data, no method of transmission over the internet or electronic storage is 100% secure. We cannot guarantee the absolute security of your information. You are also responsible for maintaining the confidentiality of your account credentials.</p><h2>5. Cookies & Tracking</h2><h3>5.1 Cookies / Session Tokens</h3><p>We may use session cookies or tokens via Firebase Authentication to identify your login status and maintain your session. These cookies or tokens are necessary for the Platform to function properly (e.g., to keep you logged in).</p><h3>5.2 Analytics</h3><p>We may use Firebase or similar analytics tools to gather usage statistics (e.g., page views, button clicks, session duration). These analytics do not typically include personally identifying data, but rather aggregated or anonymized insights about how users interact with the Platform.</p><h3>5.3 Advertising & AdSense</h3><p>If we implement Google AdSense or other ad networks, these providers may use cookies to track user behavior across sites. We will provide a link to the relevant provider’s privacy policy and inform you if third-party cookies are in use.</p><h3>5.4 Cookie Preferences</h3><p>Your browser or device may allow you to control or disable cookies. Please note that disabling certain essential cookies or tokens could affect Platform functionality (e.g., preventing you from staying logged in).</p><h2>6. Changes to This Privacy Policy</h2><p>We reserve the right to update or modify this Privacy Policy at any time. If we make material changes, we will notify you by email or by posting a notice within the Platform. Your continued use of RL Bets after any updates or modifications constitutes your acceptance of the revised Privacy Policy.</p><h2>7. Contact Us</h2><p>If you have any questions, concerns, or requests regarding this Privacy Policy or the handling of your personal data, please contact us at:</p><p><strong>Carver Endeavors LLC</strong><br>916 N Mill St Apt H<br>Festus, MO 63028<br>United States<br>Email: <a href=\"mailto:support@rlbets.gg\">support@rlbets.gg</a></p><p>By creating an account or otherwise using RL Bets, you acknowledge that you have read and understood this Privacy Policy and agree to our collection, storage, and processing of your personal data as described herein.</p></div>"
}