{
    "name": "Terms of Service",
    "date_created": "2025-01-01",
    "version": "1",
    "change_log": "Initial version",
    "content": "<div><p><strong>Last Updated:</strong> 01/19/2025</p><p>Welcome to RL Bets (the &ldquo;Service&rdquo;), operated by Carver Endeavors LLC (&ldquo;Company,&rdquo; &ldquo;we,&rdquo; &ldquo;us,&rdquo; or &ldquo;our&rdquo;), with a principal address at 916 N Mill St Apt H, Festus, MO 63028. These Terms of Service (&ldquo;Terms&rdquo;) govern your use of RL Bets, including any associated websites, mobile applications, or online services (collectively, the &ldquo;Platform&rdquo;). By accessing or using the Platform, you (&ldquo;User,&rdquo; &ldquo;you,&rdquo; or &ldquo;your&rdquo;) agree to be bound by these Terms. If you do not agree, please do not use the Platform.</p><h2>1. Acceptance &amp; Modification of Terms</h2><h3>1.1 Binding Agreement</h3><p>By creating an account, accessing, or using the Platform, you acknowledge that you have read, understood, and agree to be bound by these Terms as well as our Privacy Policy, which is incorporated herein by reference.</p><h3>1.2 Right to Modify</h3><p>We reserve the right to update or modify these Terms at any time. If we make material changes, we will notify you by email or by posting a prominent notice on the Platform. Your continued use of the Platform after such changes become effective constitutes acceptance of the updated Terms.</p><h2>2. User Eligibility &amp; Age Verification</h2><h3>2.1 Minimum Legal Betting Age</h3><p>Users must meet the minimum legal betting age in their jurisdiction, which may be 18 or 21 depending on state or local laws. By registering for an account, you represent and warrant that you meet this minimum age requirement.</p><h3>2.2 Verification via Third-Party Services</h3><p>You agree to provide accurate personal information (e.g., name, date of birth, address, Social Security number) for identity verification. We may use third-party services, such as Firebase Storage, to store documents to allow us to confirm your age, identity, and other details. You authorize us to verify your information through these services which includes document verification.</p><h2>3. Geolocation &amp; State-by-State Restrictions</h2><h3>3.1 Permitted Jurisdictions</h3><p>RL Bets is currently only available to Users physically located in U.S. states where online sports betting is legal. You agree not to access or place bets from any location outside these permitted jurisdictions.</p><h3>3.2 Geolocation Checks</h3><p>We use geolocation technologies&mdash;including Nominatim for reverse geocoding&mdash;to determine your approximate location. If we are unable to verify that you are within a permitted state, or if you appear to be located in a restricted area, you will be prevented from placing bets.</p><h3>3.3 Compliance with Local Laws</h3><p>You are responsible for ensuring that your use of the Platform complies with all applicable state and federal laws. We make no representations that the Service is available or appropriate in every jurisdiction.</p><h2>4. Fictional Credits &amp; Earned Credits</h2><h3>4.1 Credits (Purchased)</h3><ul><li>RL Bets uses a fictional currency called &ldquo;Credits.&rdquo;</li><li>Credits are purchased through Stripe using a valid credit or debit card.</li><li>Credits do not expire once purchased.</li><li>Credits cannot be refunded (unless required by law) or transferred between Users.</li></ul><h3>4.2 Earned Credits</h3><p>&ldquo;Earned Credits&rdquo; are the amount of Credits won from successful wagers. Earned Credits are accumulated separately from the purchased Credits in your account and reflect your winnings.</p><h3>4.3 No Transfers or Refunds</h3><p>Credits are non-transferable between Users and non-redeemable for cash, except as part of a valid real-money payout described in these Terms.</p><h2>5. Betting Mechanics &amp; Winnings</h2><h3>5.1 Placing Bets</h3><p>Users can view and participate in &ldquo;Wagers&rdquo; (e.g., &ldquo;Team A will win this match&rdquo;) by choosing Agree or Disagree and staking a chosen number of Credits.</p><p>There is no imposed maximum or minimum bet limit at this time, although we reserve the right to implement one if needed for regulatory or responsible-gaming reasons.</p><h3>5.2 Odds &amp; Payout Formulas</h3><p>Payouts are determined by weighted formulas that factor in the total number of Credits staked on each side of the wager. All bets on RL Bets are &ldquo;weighted&rdquo; based on the total Credits staked on each side. Suppose:</p><ul><li><strong>Bet</strong> = the amount of Credits you stake.</li><li><strong>A</strong> = the total Credits staked by everyone on the Agree side (excluding your own Bet if you are also on that side).</li><li><strong>D</strong> = the total Credits staked by everyone on the Disagree side (excluding your own Bet if you are also on that side).</li></ul><p><strong>If You Bet on &ldquo;Agree&rdquo;</strong><br>Potential Winnings = Bet + (D &times; Bet) / (Bet + D)</p><p>In other words, you receive your original Bet plus a share of the Disagree side&rsquo;s total stake. The share is proportional to your Bet relative to the total Agree stake (including your Bet).</p><p><strong>If You Bet on &ldquo;Disagree&rdquo;</strong><br>Potential Winnings = Bet + (A &times; Bet) / (Bet + A)</p><p>Similarly, if you bet on Disagree, you receive your original Bet plus a share of the Agree side&rsquo;s total stake, based on the ratio of your Bet to all other Disagree bets.</p><p>In both scenarios, your final winnings include your initial stake (if you win) plus the &ldquo;weighted&rdquo; portion of the opposing side&rsquo;s total staked Credits. If you lose, you forfeit your Bet. We reserve the right to adjust or refine these formulas from time to time for fairness and operational reasons, and any such changes will be announced or reflected on the Platform.</p><h3>5.3 Real-Money Payouts</h3><p>Depending on the rules of a specific leaderboard period or promotion, Users may be eligible to receive real-money payouts if they top the leaderboards or meet specific criteria. Payouts are generally processed via PayPal, Venmo, or Cash App, but we reserve the right to designate a single or multiple payout method(s). You are solely responsible for reporting and paying any applicable taxes on your winnings.</p><h3>5.4 Tie-Breakers</h3><p>If two or more Users share the same Earned Credits total, tie-breaking may be decided by &ldquo;seniority,&rdquo; i.e., the earlier account creation date.</p><h3>5.5 Final Scoreboard &amp; RLCS Referee Confirmation</h3><p>For wagers that depend on specific player or team statistics (e.g., Score, Goals, Assists, Shots, Saves, Demos), verification of these outcomes is based on the official scoreboard displayed at the conclusion of the match. If the scoreboard is not shown immediately or is otherwise unavailable at the end of a match, RL Bets reserves the right to delay settlement of any related wagers. In such cases, bets will not be paid out until one of the following conditions is met:</p><ul><li>The final scoreboard is displayed in an accessible live stream, broadcast, or otherwise made publicly available at a later time, confirming the official result; or</li><li>The replay is uploaded and processed by an RLCS referee on ballchasing.com, confirming the final outcome.</li></ul><p>This policy helps ensure the accuracy and fairness of wager settlements. RL Bets retains sole discretion to determine whether the final match result has been adequately verified, and we may void, delay, or otherwise adjust any wagers if contradictory or unreliable scoreboard data is discovered.</p><h2>6. Leaderboards &amp; Tie-Breakers</h2><h3>6.1 Leaderboard Display</h3><p>The Platform may feature leaderboards that rank Users by their total Earned Credits over specific timeframes. Leaderboard standings are determined solely by Earned Credits and displayed in real-time or near real-time.</p><h3>6.2 Tie-Breaker Rule</h3><p>In the event of a tie in Earned Credits, seniority (the earlier account creation date) shall rank higher. If an exact tie remains, or if any other dispute arises, we will attempt to resolve it in good faith based on the information in our records.</p><h2>7. Dispute Resolution &amp; Arbitration Clause</h2><h3>7.1 Internal Dispute Resolution</h3><p>If you have a dispute regarding a wager outcome, payout, or any other issue, please first contact us at <a href=\"mailto:support@rlbets.gg\">support@rlbets.gg</a> or through the contact method provided on the Platform. We will make reasonable efforts to investigate and address your concern promptly.</p><h3>7.2 Arbitration Agreement</h3><p>If any dispute remains unresolved, you agree to resolve the matter through binding arbitration in accordance with the rules of a neutral arbitration forum in Missouri, unless otherwise required by law. By agreeing to arbitration, you waive the right to a trial by jury or to participate in class actions.</p><h3>7.3 Governing Law &amp; Venue</h3><p>These Terms are governed by the laws of the State of Missouri, without regard to its conflict of laws principles. For disputes not subject to arbitration, you agree to submit to the personal jurisdiction of the state and federal courts located in Missouri.</p><h2>8. Account Bans &amp; Fraudulent Activity</h2><h3>8.1 Prohibitions</h3><p>You agree not to use RL Bets for any unlawful purpose, including but not limited to money laundering, collusion, or any activity intended to defraud us or other Users.</p><h3>8.2 Investigation &amp; Freezing of Accounts</h3><p>We reserve the right to freeze or suspend any account if we suspect fraudulent behavior or Terms violations. During an investigation, we may restrict your access to Credits and limit account functionality.</p><h3>8.3 Bans &amp; Forfeiture</h3><p>If we conclude, after reasonable investigation, that fraud or illegal conduct has occurred, we may ban your account and forfeit Credits associated with such activity.</p><h2>9. Limitation of Liability &amp; Indemnification</h2><h3>9.1 Limitation of Liability</h3><p>To the fullest extent permitted by law, Carver Endeavors LLC (and its owners, officers, employees, or agents) shall not be liable for any:</p><ul><li>Indirect, incidental, consequential, special, or punitive damages;</li><li>Damages for loss of profits, revenues, or data;</li><li>Damages resulting from delays, interruptions in service, or unauthorized access to your account.</li></ul><p>In no event shall our total liability to you for any claims exceed the total amount of fees or Credits you paid to us in the twelve (12) months preceding the event giving rise to the claim (or $100 if no such fees have been paid).</p><h3>9.2 Indemnification</h3><p>You agree to indemnify, defend, and hold harmless Carver Endeavors LLC (including its owners, officers, employees, and agents) from any and all claims, damages, liabilities, costs, or expenses (including reasonable attorneys&rsquo; fees) arising out of or related to:</p><ul><li>Your use or misuse of RL Bets;</li><li>Your violation of these Terms;</li><li>Your violation of any law or regulation;</li><li>Any infringement by you of a third party&rsquo;s rights.</li></ul><h2>10. Disclaimer of Affiliation</h2><h3>10.1 No Official Endorsement</h3><p>RL Bets is not affiliated with, endorsed by, or sponsored by Psyonix, Rocket League, the Rocket League Championship Series (RLCS), or any other esports league.</p><h3>10.2 Trademark Acknowledgment</h3><p>All trademarks referenced on the Platform, including team logos or names, are the property of their respective owners and are used solely for descriptive or informational purposes. Any use of these marks does not imply endorsement.</p><h2>11. Responsible Use &amp; Self-Exclusion</h2><h3>11.1 Gambling Risk</h3><p>Betting involves risk and may lead to financial loss. You should only bet what you can afford to lose. RL Bets does not guarantee profits or winnings.</p><h3>11.2 Self-Exclusion &amp; Resources</h3><p>If required by law or if we decide to implement it for user protection, we may provide self-exclusion tools and/or information about problem gambling hotlines (e.g., National Problem Gambling Helpline at 1-800-522-4700).</p><h3>11.3 No Obligation</h3><p>While we strive to maintain a fair and enjoyable betting environment, you acknowledge that we are not responsible for monitoring or managing your betting behavior beyond what is legally required.</p><h2>12. Termination</h2><p>We reserve the right to terminate or suspend your account at any time, with or without notice, for any reason&mdash;including, but not limited to, violation of these Terms, suspected fraudulent activities, or actions deemed harmful to the Platform or other Users. Upon termination, any Credits or Earned Credits may be forfeited at our sole discretion, unless otherwise required by law.</p><h2>13. Entire Agreement &amp; Severability</h2><p>These Terms, along with our Privacy Policy and any other policies referenced herein, constitute the entire agreement between you and Carver Endeavors LLC regarding your use of the Platform. If any provision of these Terms is found invalid or unenforceable by a court of competent jurisdiction, the remaining provisions shall remain in full force and effect.</p><h2>14. Contact Information</h2><p>For questions, concerns, or disputes, please contact us at:</p><p><strong>Carver Endeavors LLC</strong><br>916 N Mill St Apt H<br>Festus, MO 63028<br>United States<br>Email: <a href=\"mailto:support@rlbets.gg\">support@rlbets.gg</a></p><p><strong>BY CREATING AN ACCOUNT OR OTHERWISE USING RL BETS, YOU ACKNOWLEDGE THAT YOU HAVE READ AND UNDERSTOOD THESE TERMS AND AGREE TO BE BOUND BY THEM.</strong></p></div>"
}